ef15c/oberon_stm32f4/stm429_oberon_station/Core/Src/main.c
  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/**
  * @brief GPIO Open drain default high
  * @param None
  * @retval None
  */
void PS2_PINS_Output_OD_High(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(PS2_CLOCK_1_GPIO_Port, PS2_CLOCK_1_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_DATA_1_GPIO_Port, PS2_DATA_1_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_CLOCK_2_GPIO_Port, PS2_CLOCK_2_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_DATA_2_GPIO_Port, PS2_DATA_2_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : PS2_CLOCK_1_Pin, PS2_DATA_1_Pin, PS2_CLOCK_2_Pin, PS2_DATA_2_Pin */
  GPIO_InitStruct.Pin = PS2_CLOCK_1_Pin | PS2_DATA_1_Pin | PS2_CLOCK_2_Pin | PS2_DATA_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(PS2_CLOCK_1_GPIO_Port, &GPIO_InitStruct);
}


/**
  * @brief Initialize PS/2 handlers for the board
  * @param None
  * @retval None
  */
static void BSP_PS2_Init(void)
{
    /* Wait for completion of PS/2 devices self tests */
    HAL_Delay(500);

    /* Probe PS/2 devices */
    ps2_1.clockPort = PS2_CLOCK_1_GPIO_Port;
    ps2_1.clockPin = PS2_CLOCK_1_Pin;
    ps2_1.dataPort = PS2_DATA_1_GPIO_Port;
    ps2_1.dataPin = PS2_DATA_1_Pin;
    ps2_1.KBLedPort = LD3_GPIO_Port;
    ps2_1.KBLedPin = LD3_Pin;
    ps2_1.MouseLedPort = LD4_GPIO_Port;
    ps2_1.MouseLedPin = LD4_Pin;
    ps2_1.answerBlock = &mskbBlock;
    PS2_initHandle(&ps2_1);

    ps2_2.clockPort = PS2_CLOCK_2_GPIO_Port;
    ps2_2.clockPin = PS2_CLOCK_2_Pin;
    ps2_2.dataPort = PS2_DATA_2_GPIO_Port;
    ps2_2.dataPin = PS2_DATA_2_Pin;
    ps2_2.KBLedPort = LD3_GPIO_Port;
    ps2_2.KBLedPin = LD3_Pin;
    ps2_2.MouseLedPort = LD4_GPIO_Port;
    ps2_2.MouseLedPin = LD4_Pin;
    ps2_2.answerBlock = &mskbBlock;
    PS2_initHandle(&ps2_2);
}


/**
  * @brief  EXTI line detection callbacks.
  * @param  GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch(GPIO_Pin) {
  case PS2_CLOCK_1_Pin:
    /* First PS/2 port */
    PS2_ProcessData(&ps2_1);
    break;
  case PS2_CLOCK_2_Pin:
    /* Second PS/2 port */
    PS2_ProcessData(&ps2_2);
    break;
  case PB1_Pin:
	/* Trigger pendSV interrupt for abort processing */
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__ISB();
    break;
  }
}

void MPU_RegionConfig(void)
{
    MPU_Region_InitTypeDef MPU_InitStruct;
    /* Disable MPU */
    HAL_MPU_Disable();
    /* Configure SDRAM region as Region N°0, 4M of size and R/W region */
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = 0xD0201000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_4MB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
    /* Configure SDRAM region as REGION N°1, 4MB of size and R/W region */
    MPU_InitStruct.BaseAddress = 0xD0400000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_4MB;
    MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
    /* Enable MPU */
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
